# Stepick.org — Python в примерах и задачах
# 1. Простые программы на Python, основы вычислений


# === 1.1 Задача. "Hello, world!" ===


def m_1_1_1():
    """
    Задача
    -------------------------------------
    Написать программу, которая выводит сообщение "Я изучаю Python!".
    """
    print("Я изучаю Python!")
